#### BuiltInFailures.ElementTypeFailures Members

---

|  |
| --- |
| BuiltInFailures ElementTypeFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ElementTypeFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | NoDefaultType | As a result of Reloading Latest, there are no types of [User Name] left. Create a new type by duplicating an existing [User Name] type in the Project Browser. |
| Public property Static member | WarnLastType1 | Last type in system family '[Name]' cannot be deleted. |

# See Also

BuiltInFailures ElementTypeFailures Class

Autodesk.Revit.DB Namespace